# Pandas

In [1]:
import numpy as np
import pandas as pd

In [2]:
labels=['a','b','c','d']
my_list=[1,2,3,4]
pd.Series(data=my_list)

0    1
1    2
2    3
3    4
dtype: int64

In [3]:
pd.Series(index=labels,data=my_list)

a    1
b    2
c    3
d    4
dtype: int64

In [4]:
pd.Series(labels,my_list)

1    a
2    b
3    c
4    d
dtype: object

In [5]:
pd.Series(my_list,labels)

a    1
b    2
c    3
d    4
dtype: int64

In [6]:
arr=np.array(my_list)

In [7]:
print(arr)

[1 2 3 4]

In [8]:
pd.Series(arr)

0    1
1    2
2    3
3    4
dtype: int32

## Using Index

In [16]:
R=pd.Series([5,10,15,20],index=['A','B','C','D'])
print(R)

A     5
B    10
C    15
D    20
dtype: int64

In [12]:
E=pd.Series([25,30,35,40],index=['A','B','C','E'])

In [13]:
print(E)

A    25
B    30
C    35
E    40
dtype: int64

In [17]:
T=R+E
print(T)

A    30.0
B    40.0
C    50.0
D     NaN
E     NaN
dtype: float64

## Data Frames

In [19]:
from numpy.random import randn

In [20]:
np.random.seed(200)

In [22]:
pd.DataFrame?

In [25]:
df = pd.DataFrame(randn(5,3),index='A B C D E'.split(),columns='X Y Z'.split())

In [26]:
df

          X         Y         Z
A -1.154182  1.214984 -1.293759
B  0.822723 -0.332151 -1.281429
C  0.218538  2.083474 -0.248218
D  0.267460  0.712514 -0.653608
E  0.162280  2.213380 -0.665534

In [28]:
df.X

A   -1.154182
B    0.822723
C    0.218538
D    0.267460
E    0.162280
Name: X, dtype: float64

In [31]:
df[['X','Y']]

          X         Y
A -1.154182  1.214984
B  0.822723 -0.332151
C  0.218538  2.083474
D  0.267460  0.712514
E  0.162280  2.213380

In [32]:
df['W']=df['X']+df['Y']

In [33]:
df

          X         Y         Z         W
A -1.154182  1.214984 -1.293759  0.060802
B  0.822723 -0.332151 -1.281429  0.490572
C  0.218538  2.083474 -0.248218  2.302012
D  0.267460  0.712514 -0.653608  0.979974
E  0.162280  2.213380 -0.665534  2.375660

In [34]:
df.drop('W',axis=1)

          X         Y         Z
A -1.154182  1.214984 -1.293759
B  0.822723 -0.332151 -1.281429
C  0.218538  2.083474 -0.248218
D  0.267460  0.712514 -0.653608
E  0.162280  2.213380 -0.665534

In [35]:
df

          X         Y         Z         W
A -1.154182  1.214984 -1.293759  0.060802
B  0.822723 -0.332151 -1.281429  0.490572
C  0.218538  2.083474 -0.248218  2.302012
D  0.267460  0.712514 -0.653608  0.979974
E  0.162280  2.213380 -0.665534  2.375660

In [36]:
df.drop('W',axis=1,inplace=True)

In [37]:
df

          X         Y         Z
A -1.154182  1.214984 -1.293759
B  0.822723 -0.332151 -1.281429
C  0.218538  2.083474 -0.248218
D  0.267460  0.712514 -0.653608
E  0.162280  2.213380 -0.665534

In [38]:
df>0

       X      Y      Z
A  False   True  False
B   True  False  False
C   True   True  False
D   True   True  False
E   True   True  False

In [40]:
df[df>0]

          X         Y   Z
A       NaN  1.214984 NaN
B  0.822723       NaN NaN
C  0.218538  2.083474 NaN
D  0.267460  0.712514 NaN
E  0.162280  2.213380 NaN